; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v9)
             (pred_1 ?v2 ?v1)
             (pred_3 ?v6 ?v1)
             (pred_6 ?v3 ?v6 )
	     (pred_12 ?v6)
             (pred_10 ?v13)
             (pred_11 ?v2)
             (pred_9 ?v1)
             (pred_8 ?v6)
             (pred_5 ?v2)
             (pred_2 ?v6)
             (pred_4 ))



(:action op_1
:parameters (?v8 ?v7 ?v4 ?v12)
:precondition (and (pred_10 ?v8) (pred_10 ?v7) (pred_11 ?v4) (pred_9 ?v12)
          (pred_7 ?v8 ?v7) (pred_1 ?v4 ?v12)
                   (pred_3 ?v7 ?v12) (pred_12 ?v8) 
                   (pred_8 ?v7) (pred_5 ?v4))
:effect (and  (pred_2 ?v7) (not (pred_8 ?v7))))


(:action op_2
:parameters (?v8 ?v5)
:precondition (and (pred_10 ?v8) (pred_10 ?v5)
               (pred_12 ?v8) (pred_7 ?v8 ?v5) (pred_2 ?v5))
:effect (and (pred_12 ?v5) (not (pred_12 ?v8))))

(:action op_4
:parameters (?v8 ?v4)
:precondition (and (pred_10 ?v8) (pred_11 ?v4) 
                  (pred_12 ?v8) (pred_6 ?v4 ?v8) (pred_4 ))
:effect (and (pred_5 ?v4)
   (not (pred_6 ?v4 ?v8)) (not (pred_4 ))))


(:action op_5
:parameters (?v8 ?v10 ?v11)
:precondition (and (pred_10 ?v8) (pred_11 ?v10) (pred_11 ?v11)
                  (pred_12 ?v8) (pred_5 ?v11) (pred_6 ?v10 ?v8))
:effect (and (pred_5 ?v10) (pred_6 ?v11 ?v8)
        (not (pred_5 ?v11)) (not (pred_6 ?v10 ?v8))))

(:action op_3
:parameters (?v8 ?v4)
:precondition (and (pred_10 ?v8) (pred_11 ?v4) 
                  (pred_12 ?v8) (pred_5 ?v4))
:effect (and (pred_4 ) (pred_6 ?v4 ?v8) (not (pred_5 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_03 obj_07 obj_08 obj_06 obj_05 obj_04 obj_12 obj_15 obj_21 obj_13 obj_20 obj_19 obj_17 obj_10 obj_16
    obj_11 obj_18
    obj_09 obj_01 obj_02
    )

    (:init
       (pred_4)

       (pred_10 obj_14)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_05)
       (pred_10 obj_04)
       (pred_10 obj_12)
       (pred_10 obj_15)
       (pred_10 obj_21)
       (pred_10 obj_13)
       (pred_10 obj_20)
       (pred_10 obj_19)
       (pred_10 obj_17)
       (pred_10 obj_10)
       (pred_10 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_11 obj_09)
       (pred_11 obj_01)
       (pred_11 obj_02)

       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_07 obj_04)
       (pred_7 obj_07 obj_08)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_06 obj_15)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_05 obj_21)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_04 obj_13)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_04 obj_07)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_21)
       (pred_7 obj_15 obj_06)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_21 obj_13)
       (pred_7 obj_21 obj_05)
       (pred_7 obj_21 obj_15)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_13 obj_04)
       (pred_7 obj_13 obj_21)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_15)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_16 obj_10)
       (pred_8 obj_20)
       (pred_8 obj_03)
       (pred_8 obj_14)
       (pred_3  obj_20 obj_11)
       (pred_3  obj_03 obj_18)
       (pred_3  obj_14 obj_11)
       (pred_2 obj_07)
       (pred_2 obj_08)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_2 obj_15)
       (pred_2 obj_21)
       (pred_2 obj_13)
       (pred_2 obj_19)
       (pred_2 obj_17)
       (pred_2 obj_10)
       (pred_2 obj_16)

       (pred_1  obj_09 obj_11)
       (pred_1  obj_01 obj_18)
       (pred_1  obj_02 obj_11)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_02 obj_07)
       (pred_12 obj_16)
    )

    (:goal (and
       (pred_6 obj_09 obj_17)
       (pred_6 obj_01 obj_12)
    ))
(:constraints
  (always (not (pred_12 obj_13)))
)
)

; plan
1. (op_2 obj_16 obj_10)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_10)
   goals met: 0 of 2
2. (op_2 obj_10 obj_17)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_17)
   goals met: 0 of 2
3. (op_2 obj_17 obj_21)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_21)
   goals met: 0 of 2
4. (op_2 obj_21 obj_05)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_05)
   goals met: 0 of 2
5. (op_2 obj_05 obj_04)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_04)
   goals met: 0 of 2
6. (op_4 obj_04 obj_09)
   deleted: (pred_6 obj_09 obj_04) (pred_4)
   added: (pred_5 obj_09)
   goals met: 0 of 2
7. (op_2 obj_04 obj_12)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_12)
   goals met: 0 of 2
8. (op_1 obj_12 obj_20 obj_09 obj_11)
   deleted: (pred_8 obj_20)
   added: (pred_2 obj_20)
   goals met: 0 of 2
9. (op_2 obj_12 obj_20)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_20)
   goals met: 0 of 2
10. (op_2 obj_20 obj_16)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_16)
   goals met: 0 of 2
11. (op_2 obj_16 obj_10)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_10)
   goals met: 0 of 2
12. (op_2 obj_10 obj_17)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_17)
   goals met: 0 of 2
13. (op_3 obj_17 obj_09)
   deleted: (pred_5 obj_09)
   added: (pred_4) (pred_6 obj_09 obj_17)
   goals met: 1 of 2
14. (op_2 obj_17 obj_10)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_10)
   goals met: 1 of 2
15. (op_2 obj_10 obj_16)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_16)
   goals met: 1 of 2
16. (op_4 obj_16 obj_01)
   deleted: (pred_6 obj_01 obj_16) (pred_4)
   added: (pred_5 obj_01)
   goals met: 1 of 2
17. (op_2 obj_16 obj_20)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_20)
   goals met: 1 of 2
18. (op_2 obj_20 obj_12)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_12)
   goals met: 1 of 2
19. (op_3 obj_12 obj_01)
   deleted: (pred_5 obj_01)
   added: (pred_4) (pred_6 obj_01 obj_12)
   goals met: 2 of 2
